- To show IP addresses of all network interfaces:
  command: ip address show
  output: |
    1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
       inet 127.0.0.1/8 scope host lo
          valid_lft forever preferred_lft forever
       inet6 ::1/128 scope host
          valid_lft forever preferred_lft forever
    2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc mq state UP group default qlen 1000
       inet 192.168.1.10/24 brd 192.168.1.255 scope global eth0
          valid_lft forever preferred_lft forever
       inet6 fe80::21b:21ff:fe0c:be19/64 scope link
          valid_lft forever preferred_lft forever

- To show information about a specific network interface:
  command: ip address show eth0
  output: |
    2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc mq state UP group default qlen 1000
       inet 192.168.1.10/24 brd 192.168.1.255 scope global eth0
          valid_lft forever preferred_lft forever
       inet6 fe80::21b:21ff:fe0c:be19/64 scope link
          valid_lft forever preferred_lft forever

- To show the routing table:
  command: ip route show
  output: |
    default via 192.168.1.1 dev eth0 proto static metric 100
    192.168.1.0/24 dev eth0 proto kernel scope link src 192.168.1.10 metric 100

- To show the ARP table:
  command: ip neigh show
  output: |
    192.168.1.1 dev eth0 lladdr 00:01:2e:3f:4a:5b REACHABLE

- To add a new IP address to a network interface:
  command: ip address add 192.168.1.20/24 dev eth0

- To delete an IP address from a network interface:
  command: ip address del 192.168.1.20/24 dev eth0

- To add a new route:
  command: ip route add 10.0.0.0/24 via 192.168.1.1

- To delete a route:
  command: ip route del 10.0.0.0/24

- To add a new ARP entry:
  command: ip neigh add 192.168.1.2 lladdr 00:01:2e:3f:4a:5c dev eth0

- To delete an ARP entry:
  command: ip neigh del 192.168.1.2 lladdr 00:01:2e:3f:4a:5c dev eth0
